#include "dj_ctrl.h"
#include "main.h"



/* 限值 */
float limit(float x,float min,float max)
{
	x = (x>max) ? max : ((x<min) ? min : x);
	return x;
}


/* 舵机PWM限值 */
void DJ_Limit(void)
{
	limit(DJ1_PLUSE,1300,2350);  /* 值增大: 夹持 */
	limit(DJ2_PLUSE,500 ,2500);  /* 值无需变动 */
	limit(DJ3_PLUSE,600 ,2400);  /* 值增大: 降低 */
	limit(DJ4_PLUSE,600 ,2400);  /* 值增大: 降低 */	
	limit(DJ5_PLUSE,1000,2100);  /* 值增大: 抬高 */	
	limit(DJ6_PLUSE,500 ,2500);  /* 值增大: 逆时针转 */	
}



/* 姿态调节 */
short DJ_changed[ACT_ALL]={0};  /* 角度改变 */
void DJ_Ctrl(void)
{
	DJ5_PLUSE = DJ5_PLUSE + DJ_changed[DOWN]*7.4f;
	DJ4_PLUSE = DJ4_PLUSE + DJ_changed[DOWN]*7.4f - DJ_changed[MIDD]*7.4f;
	DJ3_PLUSE = DJ3_PLUSE                	  	  + DJ_changed[MIDD]*7.4f - DJ_changed[HIGH]*7.4f;
	
	DJ6_PLUSE = DJ6_PLUSE + DJ_changed[CIRC]*7.4f; /* 底盘 */
	DJ1_PLUSE = DJ1_PLUSE + DJ_changed[GET];	   /* 夹子 */
	
	DJ_changed[CIRC] = 0;
	DJ_changed[DOWN] = 0;
	DJ_changed[MIDD] = 0;
	DJ_changed[HIGH] = 0;
	DJ_changed[GET]  = 0;
	
	DJ_Limit(); /* 限值 */
}





/* 固定姿态值 */
/* 取放3步/5个动作/6个自由度 */
short DJ_SET[3][8][6]=
{ 
	{//RED
		{1050,1515,500 ,2400,1600,800}, /* 中间准备 */
		{1050,1515,1120,2400,1600,800}, /* 中间伸出 */
		{1950,1515,1120,2400,1600,800}, /* 中间夹取 */
		{1950,1515,500 ,2400,1600,800},  /* 缩回 */
		        
		{1950,1515,500 ,2400,1600,2325}, /* 反过来 */
		{1950,1515,1000,2050,1990,2325}, /* 准备放 */
		{1050,1515,1000,2050,1990,2325}, /* 反着放 */
		{1050,1515,925 ,2100,1500,2325}, /* 收回 */
	},          
	          
	{//GREEN         
		{1050,1515,500 ,2400,1600,800}, /* 中间准备 */
		{1050,1515,1120,2400,1600,800}, /* 中间伸出 */
		{1950,1515,1120,2400,1600,800}, /* 中间夹取 */
		{1950,1515,500 ,2400,1600,800},  /* 缩回 */
		        
		{1950,1515,500 ,2400,1600,2115}, /* 反过来 */
		{1950,1515,1000,2250,1900,2115}, /* 准备放 */
		{1050,1515,1000,2250,1900,2115}, /* 反着放 */
		{1050,1515,925 ,2100,1500,2115}, /* 收回 */
	},          
	    
	{//BLUE           
		{1050,1515,500 ,2400,1600,800}, /* 中间准备 */
		{1050,1515,1120,2400,1600,800}, /* 中间伸出 */
		{1950,1515,1120,2400,1600,800}, /* 中间夹取 */
		{1950,1515,500 ,2400,1600,800},  /* 缩回 */
		        
		{1950,1515,500 ,2400,1600,1930}, /* 反过来 */
		{1950,1515,1000,2030,1990,1930}, /* 准备放 */
		{1050,1515,1000,2030,1990,1930}, /* 反着放 */
		{1050,1515,925 ,2100,1500,1930}, /* 收回 */
	}
};


/* 固定姿态设定 */
u8 DJ_Set(short* set)
{
	DJ1_PLUSE = set[0];
	DJ2_PLUSE = set[1];
	DJ3_PLUSE = set[2];
	DJ4_PLUSE = set[3];
	DJ5_PLUSE = set[4];
	DJ6_PLUSE = set[5];
	
	DJ6_PLUSE = DJ6_PLUSE - (int)(yaw * 7.4f);  /* 抵消底盘角度误差 */
	
	DJ_Limit(); /* 限值 */
	
	return 1;
}














